rails_olympics_production_A_skeleton 3/build_rails_project/BlogApp/app/controllers/comments_controller.rb

    def destroy
        @comment = Comment.find_by(id: params[:id])
        @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 7]]