rails_olympics_production_A_skeleton 3/build_rails_project/BlogApp/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", "blah@blah.com"], ["created_at", "2019-09-20 23:05:19.955365"], ["updated_at", "2019-09-20 23:05:19.955365"]]
---
    def create
        @user = User.new(params.require(:user).permit(:email))
        if @user.save