W7D2/music_app/app/controllers/application_controller.rb

  def current_user
    #look for a user
    @current_user ||= User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "07UM6qnJJoxnV-rqwxoMbA"], ["LIMIT", 1]]